-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 opened on:  23 Jan 2021, 23:53:56

. 
. use ../temp/data_firms.dta, clear

. merge m:1 t_state using ../temp/data_state.dta, assert(3) keep(3) ///
>     keepusing(N_t M_t) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,491  
    -----------------------------------------

. drop if labor == 0 & N_m != 0 
(242 observations deleted)

. keep if N_t <= 20 & M_t <= 10
(921 observations deleted)

. unique t_state
Number of unique values of t_state is  29
Number of records is  328

. rename N_m n

. rename wage w

. rename rent r

. rename labor l 

. keep t_state cea n w r x l N_t M_t

. sum w

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |        328    885.4394    164.3481   560.2916   1475.667

. replace w = w / r(mean)
(328 real changes made)

. sum r

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           r |        328     647.778    183.0943     431.75       1172

. replace r = r / r(mean)
(328 real changes made)

. save ../temp/raw.dta, replace
(note: file ../temp/raw.dta not found)
file ../temp/raw.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/raw_xw.dta, replace 
(note: file ../temp/raw_xw.dta not found)
file ../temp/raw_xw.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 t_state using ../temp/raw_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               328  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. list if _n < 20

     +---------------------------+
     | cea   t   n   t_state   m |
     |---------------------------|
  1. |  10   1   2         2   1 |
  2. | 346   1   1         2   2 |
  3. | 214   2   8         4   1 |
  4. | 284   2   3         4   2 |
  5. | 311   2   1         4   3 |
     |---------------------------|
  6. | 310   2   0         4   4 |
  7. |  74   3   9         8   1 |
  8. | 222   3   3         8   2 |
  9. | 114   3   2         8   3 |
 10. | 336   3   1         8   4 |
     |---------------------------|
 11. |  96   3   0         8   5 |
 12. |  60   3   0         8   6 |
 13. |  38   3   0         8   7 |
 14. | 122   4   8         9   1 |
 15. | 193   4   7         9   2 |
     |---------------------------|
 16. | 194   4   1         9   3 |
 17. | 303   5   2        10   1 |
 18. |  78   5   1        10   2 |
 19. | 257   6   5        13   1 |
     +---------------------------+

. save ../temp/mt.dta, replace
(note: file ../temp/mt.dta not found)
file ../temp/mt.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 cea t using ../temp/mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               328  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |        328    15.42683    8.489649          1         29
     t_state |        328    30.50915    15.83033          2         56
         cea |        328    162.2896    103.1704          3        347
           m |        328    2.143293    1.510681          1          8
           n |        328    4.707317    3.010635          0         11
-------------+---------------------------------------------------------
           w |        328           1    .1856119   .6327837   1.666592
           r |        328           1    .2826497   .6665092   1.809262
           x |        328    2725.067    3645.892         63      16659
           l |        328    38.30793    90.40618          0       1000
         N_t |        328    13.60366    4.614323          1         20
-------------+---------------------------------------------------------
         M_t |        328    4.887195    1.999102          1          8

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. keep t m n w r x l

. export delimited using ../output/data.csv, replace novar delim(",")
(note: file ../output/data.csv not found)
file ../output/data.csv saved

. 
. * Small sample
. use ../temp/raw.dta, clear

. keep if N_t <= 10
(255 observations deleted)

. save ../temp/small.dta, replace
(note: file ../temp/small.dta not found)
file ../temp/small.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/small_xw.dta, replace 
(note: file ../temp/small_xw.dta not found)
file ../temp/small_xw.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 t_state using ../temp/small_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                73  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. save ../temp/small_mt.dta, replace
(note: file ../temp/small_mt.dta not found)
file ../temp/small_mt.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 cea t using ../temp/small_mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                73  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |         73    7.493151     3.33801          1         13
     t_state |         73    28.72603    11.46281          2         50
         cea |         73    147.4521    116.4703          5        346
           m |         73    1.821918     1.12228          1          6
           n |         73    2.945205    1.892165          0          7
-------------+---------------------------------------------------------
           w |         73    .9666553    .1656397   .6327837   1.341128
           r |         73    1.032735    .2711458   .7231558   1.726865
           x |         73    2495.027     3758.28         63      13178
           l |         73    39.53425    59.54879          0        400
         N_t |         73    6.917808    2.618065          1         10
-------------+---------------------------------------------------------
         M_t |         73    3.315068    1.544495          1          6

. save ../output/small.dta, replace
(note: file ../output/small.dta not found)
file ../output/small.dta saved

. keep t m n w r x l

. export delimited using ../output/small.csv, replace novar delim(",")
(note: file ../output/small.csv not found)
file ../output/small.csv saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 closed on:  23 Jan 2021, 23:53:56
-------------------------------------------------------------------------------
