-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 opened on:  22 Jan 2021, 16:44:30

. 
. use ../temp/data_firms.dta, clear

. merge m:1 t_state using ../temp/data_state.dta, assert(3) keep(3) ///
>     keepusing(N_t M_t) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,491  
    -----------------------------------------

. keep if N_t <= 20 & M_t <= 10
(1,081 observations deleted)

. unique t_state
Number of unique values of t_state is  29
Number of records is  410

. rename N_m n

. rename wage w

. rename rent r

. rename labor l 

. keep t_state cea n w r x l N_t M_t

. replace x = log(x)
(410 real changes made)

. sum x

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |        410    7.126951     1.22132   4.143135   9.720706

. replace x = 0.1 * x / r(mean)
(410 real changes made)

. sum w

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |        410     877.594    161.9656   560.2916   1475.667

. replace w = w / r(mean)
(410 real changes made)

. sum r

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           r |        410    641.1974    177.5719     431.75       1172

. replace r = r / r(mean)
(410 real changes made)

. sum l

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           l |        410    30.64634    82.28001          0       1000

. replace l = l / r(mean)
(308 real changes made)

. save ../temp/raw.dta, replace
(note: file ../temp/raw.dta not found)
file ../temp/raw.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/raw_xw.dta, replace 
(note: file ../temp/raw_xw.dta not found)
file ../temp/raw_xw.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 t_state using ../temp/raw_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               410  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. list if _n < 20

     +---------------------------+
     | cea   t   n   t_state   m |
     |---------------------------|
  1. |  10   1   2         2   1 |
  2. | 346   1   1         2   2 |
  3. | 214   2   8         4   1 |
  4. | 284   2   3         4   2 |
  5. | 311   2   1         4   3 |
     |---------------------------|
  6. | 310   2   0         4   4 |
  7. |  74   3   9         8   1 |
  8. | 222   3   3         8   2 |
  9. | 114   3   2         8   3 |
 10. | 336   3   1         8   4 |
     |---------------------------|
 11. |  60   3   0         8   5 |
 12. |  96   3   0         8   6 |
 13. |  38   3   0         8   7 |
 14. | 122   4   8         9   1 |
 15. | 193   4   7         9   2 |
     |---------------------------|
 16. | 194   4   1         9   3 |
 17. | 303   5   2        10   1 |
 18. |  78   5   1        10   2 |
 19. | 257   6   5        13   1 |
     +---------------------------+

. save ../temp/mt.dta, replace
(note: file ../temp/mt.dta not found)
file ../temp/mt.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 cea t using ../temp/mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               410  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |        410    15.31707      8.4052          1         29
     t_state |        410    30.31463    15.66336          2         56
         cea |        410    165.6122    105.0509          3        347
           m |        410    2.197561    1.502238          1          8
           n |        410    4.443902    2.959056          0         11
-------------+---------------------------------------------------------
           w |        410           1    .1845564   .6384406   1.681491
           r |        410           1     .276938   .6733496    1.82783
           x |        410          .1    .0171366   .0581333   .1363936
           l |        410           1    2.684823          0   32.63032
         N_t |        410    13.33415    4.708942          1         20
-------------+---------------------------------------------------------
         M_t |        410    4.902439    1.997613          1          8

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. keep t m n w r x l

. export delimited using ../output/data.csv, replace novar delim(",")
(note: file ../output/data.csv not found)
file ../output/data.csv saved

. 
. * Small sample
. use ../temp/raw.dta, clear

. keep if N_t <= 10
(309 observations deleted)

. save ../temp/small.dta, replace
(note: file ../temp/small.dta not found)
file ../temp/small.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/small_xw.dta, replace 
(note: file ../temp/small_xw.dta not found)
file ../temp/small_xw.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 t_state using ../temp/small_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               101  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. save ../temp/small_mt.dta, replace
(note: file ../temp/small_mt.dta not found)
file ../temp/small_mt.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 cea t using ../temp/small_mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               101  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |        101    7.435644    3.281511          1         13
     t_state |        101    28.44554    11.31059          2         50
         cea |        101    156.7822    118.9581          5        346
           m |        101     1.90099    1.187476          1          6
           n |        101    2.782178    1.786639          0          7
-------------+---------------------------------------------------------
           w |        101    .9635509    .1625986   .6384406   1.353117
           r |        101    1.028707    .2657101   .7305776   1.744588
           x |        101    .0973587    .0170151   .0581333   .1331047
           l |        101    .9323872    1.747922          0   13.05213
         N_t |        101    6.891089    2.679183          1         10
-------------+---------------------------------------------------------
         M_t |        101    3.376238    1.573858          1          6

. save ../output/small.dta, replace
(note: file ../output/small.dta not found)
file ../output/small.dta saved

. keep t m n w r x l

. export delimited using ../output/small.csv, replace novar delim(",")
(note: file ../output/small.csv not found)
file ../output/small.csv saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 closed on:  22 Jan 2021, 16:44:30
-------------------------------------------------------------------------------
