-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 opened on:  15 Jan 2021, 10:41:36

. 
. use ../temp/data_firms.dta, clear

. merge m:1 t_state using ../temp/data_state.dta, assert(3) keep(3) ///
>     keepusing(N_t M_t) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,204  
    -----------------------------------------

. keep if N_t <= 20 & M_t <= 10
(877 observations deleted)

. unique t_state
Number of unique values of t_state is  30
Number of records is  327

. rename N_m n

. rename wage w

. rename rent r

. rename labor l 

. keep t_state cea n w r x l N_t M_t

. replace x = log(x)
(327 real changes made)

. sum x

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |        327    7.252497     1.17058   4.584968   9.720706

. replace x = x / r(mean)
(327 real changes made)

. sum w

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           w |        327    902.1544    164.0728        580   1475.667

. replace w = w / r(mean)
(327 real changes made)

. sum r

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           r |        327    646.8551    185.4248        432       1187

. replace r = r / r(mean)
(327 real changes made)

. sum l

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           l |        327    40.24771    90.36774          1       1000

. replace l = l / r(mean)
(327 real changes made)

. save ../temp/raw.dta, replace
(note: file ../temp/raw.dta not found)
file ../temp/raw.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/raw_xw.dta, replace 
(note: file ../temp/raw_xw.dta not found)
file ../temp/raw_xw.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 t_state using ../temp/raw_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. list if _n < 20

     +---------------------------+
     | cea   t   n   t_state   m |
     |---------------------------|
  1. | 183   1   3         1   1 |
  2. |  12   1   3         1   2 |
  3. |  77   1   3         1   3 |
  4. | 187   1   3         1   4 |
  5. |  32   1   2         1   5 |
     |---------------------------|
  6. | 128   1   2         1   6 |
  7. |  63   1   2         1   7 |
  8. |  94   1   1         1   8 |
  9. |  10   2   2         2   1 |
 10. | 346   2   1         2   2 |
     |---------------------------|
 11. | 214   3   8         4   1 |
 12. | 284   3   3         4   2 |
 13. | 311   3   1         4   3 |
 14. |  74   4   9         8   1 |
 15. | 222   4   3         8   2 |
     |---------------------------|
 16. | 114   4   2         8   3 |
 17. | 336   4   1         8   4 |
 18. | 122   5   8         9   1 |
 19. | 193   5   7         9   2 |
     +---------------------------+

. save ../temp/mt.dta, replace
(note: file ../temp/mt.dta not found)
file ../temp/mt.dta saved

. 
. use ../temp/raw.dta, clear

. merge m:1 cea t using ../temp/mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |        327    15.61774    9.015872          1         30
     t_state |        327    28.95107    16.89549          1         56
         cea |        327     156.893    100.6438          3        346
           m |        327     2.04893    1.391492          1          8
           n |        327     4.87156    2.826586          1         11
-------------+---------------------------------------------------------
           w |        327           1    .1818678   .6429055   1.635714
           r |        327           1    .2866558   .6678466   1.835032
           x |        327           1    .1614037   .6321916   1.340325
           l |        327           1    2.245289   .0248461   24.84614
         N_t |        327    13.91743    4.676259          1         20
-------------+---------------------------------------------------------
         M_t |        327    4.189602    1.880025          1          8

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. keep t m n w r x l

. export delimited using ../output/data.csv, replace novar delim(",")
(note: file ../output/data.csv not found)
file ../output/data.csv saved

. 
. * Small sample
. use ../temp/raw.dta, clear

. keep if N_t <= 10
(258 observations deleted)

. save ../temp/small.dta, replace
(note: file ../temp/small.dta not found)
file ../temp/small.dta saved

. 
. collapse (first) n, by(t_state)

. gen t = _n

. keep t t_state

. save ../temp/small_xw.dta, replace 
(note: file ../temp/small_xw.dta not found)
file ../temp/small_xw.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 t_state using ../temp/small_xw.dta, assert(3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                69  
    -----------------------------------------

. collapse (first) n t_state, by(t cea)

. bysort t: egen n_rank = rank(-n), unique

. sort t n_rank

. rename n_rank m

. save ../temp/small_mt.dta, replace
(note: file ../temp/small_mt.dta not found)
file ../temp/small_mt.dta saved

. 
. use ../temp/small.dta, clear

. merge m:1 cea t using ../temp/small_mt.dta, assert(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                69  
    -----------------------------------------

. ds
cea      x        w        n        M_t      m
l        t_state  r        N_t      t

. order t t_state cea m n w r x l

. sort t m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           t |         69    7.521739    3.385126          1         13
     t_state |         69    28.78261    11.70328          2         50
         cea |         69    144.5362    115.6503          5        346
           m |         69    1.724638    1.069415          1          6
           n |         69    3.115942    1.803071          1          7
-------------+---------------------------------------------------------
           w |         69    .9791239    .1709015   .6429055   1.333554
           r |         69    1.041537    .2865316    .709587   1.835032
           x |         69    .9799153     .165141   .6506034   1.308005
           l |         69    1.039217    1.502602   .0745384   9.938455
         N_t |         69    6.884058    2.615206          1         10
-------------+---------------------------------------------------------
         M_t |         69    2.855072    1.574385          1          6

. save ../output/small.dta, replace
(note: file ../output/small.dta not found)
file ../output/small.dta saved

. keep t m n w r x l

. export delimited using ../output/small.csv, replace novar delim(",")
(note: file ../output/small.csv not found)
file ../output/small.csv saved

. 
. log close
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Sample/code/../output/ana
> lysis.log
  log type:  text
 closed on:  15 Jan 2021, 10:41:37
-------------------------------------------------------------------------------
