-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Main/code/../output/analy
> sis.log
  log type:  text
 opened on:  11 Jan 2021, 15:20:36

. 
. import delimited using ../temp/cea_fips_xw.csv, clear varnames(1)
(28 vars, 3,273 obs)

. ds
fips       census     v9         v13        v17        v21        v25
name       v6         land       v14        v18        v22        v26
state      v7         v11        v15        v19        v23        v27
statename  revised    v12        v16        v20        v24        v28

. keep fips name state v26 

. rename v26 cea

. unique cea
Number of unique values of cea is  355
Number of records is  3273

. gen ch_fip = regexm(fips, "[a-zA-Z]")

. drop if ch_fip == 1
(34 observations deleted)

. drop ch_fip

. destring fips, replace
fips: all characters numeric; replaced as long
(2 missing values generated)

. unique fips
Number of unique values of fips is  3238
Number of records is  3239

. duplicates tag fips, gen(dup_fips)

Duplicates in terms of fips

. tab dup_fips

   dup_fips |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,237       99.94       99.94
          1 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,239      100.00

. list if dup_fips > 0

      +--------------------------------------+
      | fips   name   state   cea   dup_fips |
      |--------------------------------------|
3238. |    .                    .          1 |
3239. |    .                    .          1 |
      +--------------------------------------+

. drop if dup_fips > 0
(2 observations deleted)

. desc

Contains data
  obs:         3,237                          
 vars:             5                          
 size:       129,480                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fips            long    %10.0g                FIPS
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save ../temp/xw.dta, replace
(note: file ../temp/xw.dta not found)
file ../temp/xw.dta saved

. 
. import delimited using ../temp/efsy_cbp_2016.csv, clear varnames(1)
(4 vars, 1,854,430 obs)

. desc

Contains data
  obs:     1,854,430                          
 vars:             4                          
 size:    24,107,590                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        byte    %8.0g                 
fipscty         int     %8.0g                 
naics           str6    %9s                   
emp             long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if regexm(naics, "^23")
(1,727,513 observations deleted)

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    fipstate |    126,917    30.36973     15.1944          1         56
     fipscty |    126,917    98.85467    106.8014          1        840
       naics |          0
         emp |    126,917    246.4378    1529.883          1     160568

. 
. use ../temp/infogroup.dta, clear

. desc

Contains data from ../temp/infogroup.dta
  obs:        42,784                          
 vars:            54                          
 size:    46,206,720                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
archive_versi~r double  %12.0g                
abi             str12   %12s                  ABI Number
ticker          str6    %6s                   Ticker
parent_number   str12   %12s                  Parent Number
company         str32   %32s                  Name Of Business
address_line_1  str32   %32s                  Address
city            str18   %18s                  City
state           str4    %4s                   State
zipcode         str8    %8s                   Zip Code (5 Digit)
zip4            str6    %6s                   Zip Code Extension (4 Digit)
county_code     str6    %6s                   County Code
area_code       str6    %6s                   Area Code
idcode          str4    %4s                   Business/Individual Indicator
location_empl~e str4    %4s                   Location Employee Size Code
location_sale~e str4    %4s                   Location Sales Volume Code
primary_sic_c~e str8    %8s                   Primary SIC Code
sic6_descript~s str100  %100s                 SIC Code Description
primary_naics~e str10   %10s                  Primary NAICS Code
naics8_descri~s str100  %100s                 NAICS Description
sic_code        str8    %8s                   SIC Code
sic6_descript~c str100  %100s                 SIC Code Description
sic_code_1      str8    %8s                   SIC Code 1
sic6_descript~1 str100  %100s                 SIC Code 1 Description
sic_code_2      str8    %8s                   SIC Code 2
sic6_descript~2 str100  %100s                 SIC Code 2 Description
sic_code_3      str8    %8s                   SIC Code 3
sic6_descript~3 str100  %100s                 SIC Code 3 Description
sic_code_4      str8    %8s                   SIC Code 4
sic6_descript~4 str100  %100s                 SIC Code 4 Description
yellow_page_c~e str8    %8s                   Yellow Page Code
business_stat~e str4    %4s                   Business Status Code
industry_spec~e str4    %4s                   Industry Specific First Byte
office_size_c~e str2    %2s                   Office Size Code
company_holdi~s str4    %4s                   Company Holding Status
subsidiary_nu~r str12   %12s                  Subsidiary Number
parent_employ~e str4    %4s                   Parent Employee Size Code
parent_sales_~e str4    %4s                   Parent Sales Volume Code
site_number     str12   %12s                  Site Number
address_type_~r str4    %4s                   Address Type Indicator
population_code str4    %4s                   Population Code
census_tract    str8    %8s                   Census Tract
census_block    str4    %4s                   Census Block
match_code      str4    %4s                   Match Code
cbsa_code       str8    %8s                   CBSA Code
cbsa_level      str4    %4s                   CBSA Level
csa_code        str6    %6s                   CSA Code
fips_code       str8    %8s                   FIPS Code
year_establis~d double  %12.0g                
employee_size~n double  %12.0g                
sales_volume_~n double  %12.0g                
parent_actua~ze double  %12.0g                
parent_actua~me double  %12.0g                
latitude        double  %12.0g                Latitude
longitude       double  %12.0g                Longitude
-------------------------------------------------------------------------------
Sorted by: 

. keep primary_naics_code sic_code* fips_code employee_size_location archive 

. rename fips_code fips

. rename employ labor 

. rename archive year

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     42,784    2017.992    .8162892       2017       2019
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
-------------+---------------------------------------------------------
  sic_code_3 |          0
  sic_code_4 |          0
        fips |          0
       labor |     42,746    16.62855    54.51435          1       4000

. desc

Contains data from ../temp/infogroup.dta
  obs:        42,784                          
 vars:             9                          
 size:     3,166,016                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
year            double  %12.0g                
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            str8    %8s                   FIPS Code
labor           double  %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if year == 2017
(28,366 observations deleted)

. drop year

. destring fips, replace
fips: all characters numeric; replaced as long

. 
. gen rmc = regexm(primary_naics_code, "^3273")

. replace rmc = regexm(sic_code, "^3273") if rmc == 0
(812 real changes made)

. forv i = 1/4 {
  2.     replace rmc = regexm(sic_code_`i', "^3273") if rmc == 0
  3. }
(209 real changes made)
(41 real changes made)
(15 real changes made)
(9 real changes made)

. count if rmc
  3,328

. keep if rmc
(11,090 observations deleted)

. 
. drop if fips == 2230 | fips == 2275 | fips == 8014
(1 observation deleted)

. merge m:1 fips using ../temp/xw.dta, assert(2 3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,327  
    -----------------------------------------

. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
  sic_code_3 |          0
-------------+---------------------------------------------------------
  sic_code_4 |          0
        fips |      3,327    30214.42    15360.23       1001      56033
       labor |      3,323    24.58893    80.12819          1       4000
         rmc |      3,327           1           0          1          1
        name |          0
-------------+---------------------------------------------------------
       state |          0
         cea |      3,327    163.5404    93.93454          1        348
    dup_fips |      3,327           0           0          0          0

. desc

Contains data from ../temp/infogroup.dta
  obs:         3,327                          
 vars:            13                          
 size:       339,354                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            long    %10.0g                FIPS Code
labor           double  %12.0g                
rmc             float   %9.0g                 
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. list if _n < 20

      +-----------------------------------------------------------------+
   1. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   521126 |   503208 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1001  |    10  |   1  |   Autauga  |    AL  | 187  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   2. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32731001 |   521128 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1003  |    15  |   1  |   Baldwin  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   3. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 44419012 |   503208 |   327301 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1003  |   135  |   1  |   Baldwin  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   4. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1005  |     6  |   1  |   Barbour  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   5. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 44419012 |   327301 |   327209 |   327101 |   503211 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1009  |     5  |   1  |    Blount  |    AL  |  32  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   6. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   503208 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1013  |    10  |   1  |    Butler  |    AL  | 187  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   7. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1015  |     1  |   1  |   Calhoun  |    AL  |  12  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   8. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 23811001 |   521128 |   327301 |   503208 |   142901 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1015  |   120  |   1  |   Calhoun  |    AL  |  12  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   9. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   999966 |   421304 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1019  |    20  |   1  |  Cherokee  |    AL  |  16  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  10. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 44419012 |   327301 |   503208 |   327209 |   521152 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1025  |     4  |   1  |    Clarke  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  11. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 44419012 |   327209 |   327301 |   521126 |   999966 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1029  |    75  |   1  |  Cleburne  |    AL  |  16  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  12. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 44419012 |   327301 |   503208 |   503206 |   521152 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1031  |     9  |   1  |    Coffee  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  13. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |   327209 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1031  |     6  |   1  |    Coffee  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  14. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32731001 |   521128 |   177105 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1031  |     1  |   1  |    Coffee  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  15. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32733102 |   521128 |   503208 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1033  |     8  |   1  |   Colbert  |    AL  |  94  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  16. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 23811001 |   327301 |   327209 |   521128 |   171107 |   171108 |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1035  |    20  |   1  |   Conecuh  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  17. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   521128 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1039  |    10  |   1  | Covington  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  18. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   327209 |   171108 |   503208 |   521128 |   171107 |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1039  |    35  |   1  | Covington  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  19. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |   078111 |   327209 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1045  |     1  |   1  |      Dale  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. 
. tab labor

      labor |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        118        3.55        3.55
          2 |        160        4.81        8.37
          3 |        177        5.33       13.69
          4 |        192        5.78       19.47
          5 |        272        8.19       27.66
          6 |        163        4.91       32.56
          7 |        156        4.69       37.26
          8 |        151        4.54       41.80
          9 |         79        2.38       44.18
         10 |        227        6.83       51.01
         11 |         56        1.69       52.69
         12 |        130        3.91       56.61
         13 |         44        1.32       57.93
         14 |         52        1.56       59.49
         15 |        149        4.48       63.98
         16 |         32        0.96       64.94
         17 |         24        0.72       65.66
         18 |         32        0.96       66.63
         19 |         23        0.69       67.32
         20 |        161        4.85       72.16
         21 |         17        0.51       72.68
         22 |         26        0.78       73.46
         23 |         13        0.39       73.85
         24 |         14        0.42       74.27
         25 |        103        3.10       77.37
         26 |          7        0.21       77.58
         27 |          8        0.24       77.82
         28 |          8        0.24       78.06
         29 |         10        0.30       78.36
         30 |        129        3.88       82.24
         31 |          4        0.12       82.37
         32 |          9        0.27       82.64
         33 |          2        0.06       82.70
         34 |          5        0.15       82.85
         35 |         45        1.35       84.20
         36 |          4        0.12       84.32
         37 |          5        0.15       84.47
         38 |          4        0.12       84.59
         39 |          4        0.12       84.71
         40 |         69        2.08       86.79
         41 |          2        0.06       86.85
         42 |          3        0.09       86.94
         44 |          1        0.03       86.97
         45 |         22        0.66       87.63
         46 |          4        0.12       87.75
         47 |          3        0.09       87.84
         48 |          4        0.12       87.96
         49 |          7        0.21       88.17
         50 |         83        2.50       90.67
         51 |          5        0.15       90.82
         52 |          1        0.03       90.85
         54 |          1        0.03       90.88
         55 |          9        0.27       91.15
         56 |          2        0.06       91.21
         58 |          1        0.03       91.24
         60 |         26        0.78       92.03
         63 |          2        0.06       92.09
         65 |         11        0.33       92.42
         66 |          1        0.03       92.45
         67 |          1        0.03       92.48
         70 |         19        0.57       93.05
         72 |          3        0.09       93.14
         73 |          1        0.03       93.17
         75 |         14        0.42       93.59
         76 |          1        0.03       93.62
         78 |          2        0.06       93.68
         79 |          1        0.03       93.71
         80 |         18        0.54       94.25
         85 |          5        0.15       94.40
         88 |          3        0.09       94.49
         89 |          1        0.03       94.52
         90 |         10        0.30       94.82
         93 |          1        0.03       94.85
         95 |          2        0.06       94.91
         98 |          1        0.03       94.94
         99 |          2        0.06       95.00
        100 |         56        1.69       96.69
        101 |          3        0.09       96.78
        110 |          4        0.12       96.90
        115 |          1        0.03       96.93
        117 |          1        0.03       96.96
        120 |          8        0.24       97.20
        125 |          8        0.24       97.44
        126 |          1        0.03       97.47
        130 |          7        0.21       97.68
        135 |          1        0.03       97.71
        140 |          5        0.15       97.86
        149 |          1        0.03       97.89
        150 |         21        0.63       98.53
        158 |          1        0.03       98.56
        160 |          2        0.06       98.62
        165 |          1        0.03       98.65
        170 |          1        0.03       98.68
        175 |          2        0.06       98.74
        180 |          1        0.03       98.77
        200 |         14        0.42       99.19
        210 |          1        0.03       99.22
        215 |          1        0.03       99.25
        220 |          1        0.03       99.28
        250 |          6        0.18       99.46
        300 |          6        0.18       99.64
        301 |          1        0.03       99.67
        340 |          1        0.03       99.70
        350 |          2        0.06       99.76
        375 |          1        0.03       99.79
        400 |          2        0.06       99.85
        450 |          1        0.03       99.88
        500 |          2        0.06       99.94
        700 |          1        0.03       99.97
       4000 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,323      100.00

. 
. 
end of do-file


