-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Main/code/../output/analy
> sis.log
  log type:  text
 opened on:  11 Jan 2021, 16:00:38

. 
. import delimited using ../temp/cea_fips_xw.csv, clear varnames(1)
(28 vars, 3,273 obs)

. ds
fips       census     v9         v13        v17        v21        v25
name       v6         land       v14        v18        v22        v26
state      v7         v11        v15        v19        v23        v27
statename  revised    v12        v16        v20        v24        v28

. keep fips name state v26 

. rename v26 cea

. unique cea
Number of unique values of cea is  355
Number of records is  3273

. gen ch_fip = regexm(fips, "[a-zA-Z]")

. drop if ch_fip == 1
(34 observations deleted)

. drop ch_fip

. destring fips, replace
fips: all characters numeric; replaced as long
(2 missing values generated)

. unique fips
Number of unique values of fips is  3238
Number of records is  3239

. duplicates tag fips, gen(dup_fips)

Duplicates in terms of fips

. tab dup_fips

   dup_fips |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,237       99.94       99.94
          1 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,239      100.00

. list if dup_fips > 0

      +--------------------------------------+
      | fips   name   state   cea   dup_fips |
      |--------------------------------------|
3238. |    .                    .          1 |
3239. |    .                    .          1 |
      +--------------------------------------+

. drop if dup_fips > 0
(2 observations deleted)

. desc

Contains data
  obs:         3,237                          
 vars:             5                          
 size:       129,480                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fips            long    %10.0g                FIPS
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save ../temp/xw.dta, replace
(note: file ../temp/xw.dta not found)
file ../temp/xw.dta saved

. 
. import delimited using ../temp/efsy_cbp_2016.csv, clear varnames(1)
(4 vars, 1,854,430 obs)

. desc

Contains data
  obs:     1,854,430                          
 vars:             4                          
 size:    24,107,590                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        byte    %8.0g                 
fipscty         int     %8.0g                 
naics           str6    %9s                   
emp             long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if regexm(naics, "^23")
(1,727,513 observations deleted)

. keep if naics == "236220"
(124,507 observations deleted)

. gen fips = fipstate*1000 + fipscty

. drop fipstate fipscty

. unique fips
Number of unique values of fips is  2410
Number of records is  2410

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       naics |          0
         emp |      2,410    232.1552    779.9981          1      12277
        fips |      2,410    30090.91    15056.12       1001      56043

. save ../temp/demand.dta, replace
(note: file ../temp/demand.dta not found)
file ../temp/demand.dta saved

. 
. use ../temp/infogroup.dta, clear

. desc

Contains data from ../temp/infogroup.dta
  obs:        30,737                          
 vars:            54                          
 size:    33,195,960                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
archive_versi~r double  %12.0g                
abi             str12   %12s                  ABI Number
ticker          str6    %6s                   Ticker
parent_number   str12   %12s                  Parent Number
company         str32   %32s                  Name Of Business
address_line_1  str32   %32s                  Address
city            str18   %18s                  City
state           str4    %4s                   State
zipcode         str8    %8s                   Zip Code (5 Digit)
zip4            str6    %6s                   Zip Code Extension (4 Digit)
county_code     str6    %6s                   County Code
area_code       str6    %6s                   Area Code
idcode          str4    %4s                   Business/Individual Indicator
location_empl~e str4    %4s                   Location Employee Size Code
location_sale~e str4    %4s                   Location Sales Volume Code
primary_sic_c~e str8    %8s                   Primary SIC Code
sic6_descript~s str100  %100s                 SIC Code Description
primary_naics~e str10   %10s                  Primary NAICS Code
naics8_descri~s str100  %100s                 NAICS Description
sic_code        str8    %8s                   SIC Code
sic6_descript~c str100  %100s                 SIC Code Description
sic_code_1      str8    %8s                   SIC Code 1
sic6_descript~1 str100  %100s                 SIC Code 1 Description
sic_code_2      str8    %8s                   SIC Code 2
sic6_descript~2 str100  %100s                 SIC Code 2 Description
sic_code_3      str8    %8s                   SIC Code 3
sic6_descript~3 str100  %100s                 SIC Code 3 Description
sic_code_4      str8    %8s                   SIC Code 4
sic6_descript~4 str100  %100s                 SIC Code 4 Description
yellow_page_c~e str8    %8s                   Yellow Page Code
business_stat~e str4    %4s                   Business Status Code
industry_spec~e str4    %4s                   Industry Specific First Byte
office_size_c~e str2    %2s                   Office Size Code
company_holdi~s str4    %4s                   Company Holding Status
subsidiary_nu~r str12   %12s                  Subsidiary Number
parent_employ~e str4    %4s                   Parent Employee Size Code
parent_sales_~e str4    %4s                   Parent Sales Volume Code
site_number     str12   %12s                  Site Number
address_type_~r str4    %4s                   Address Type Indicator
population_code str4    %4s                   Population Code
census_tract    str8    %8s                   Census Tract
census_block    str4    %4s                   Census Block
match_code      str4    %4s                   Match Code
cbsa_code       str8    %8s                   CBSA Code
cbsa_level      str4    %4s                   CBSA Level
csa_code        str6    %6s                   CSA Code
fips_code       str8    %8s                   FIPS Code
year_establis~d double  %12.0g                
employee_size~n double  %12.0g                
sales_volume_~n double  %12.0g                
parent_actua~ze double  %12.0g                
parent_actua~me double  %12.0g                
latitude        double  %12.0g                Latitude
longitude       double  %12.0g                Longitude
-------------------------------------------------------------------------------
Sorted by: 

. keep primary_naics_code sic_code* fips_code employee_size_location archive 

. rename fips_code fips

. rename employ labor 

. rename archive year

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     30,737        2016           0       2016       2016
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
-------------+---------------------------------------------------------
  sic_code_3 |          0
  sic_code_4 |          0
        fips |          0
       labor |     30,729    11.26451    29.78996          1       2000

. desc

Contains data from ../temp/infogroup.dta
  obs:        30,737                          
 vars:             9                          
 size:     2,274,538                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
year            double  %12.0g                
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            str8    %8s                   FIPS Code
labor           double  %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if year == 2016
(0 observations deleted)

. drop year

. destring fips, replace
fips: all characters numeric; replaced as long

. 
. gen rmc = regexm(primary_naics_code, "^3273")

. replace rmc = regexm(sic_code, "^3273") if rmc == 0
(53 real changes made)

. forv i = 1/4 {
  2.     replace rmc = regexm(sic_code_`i', "^3273") if rmc == 0
  3. }
(39 real changes made)
(14 real changes made)
(2 real changes made)
(6 real changes made)

. count if rmc
  4,475

. keep if rmc
(26,262 observations deleted)

. 
. merge m:1 fips using ../temp/xw.dta, assert(2 3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             4,475  
    -----------------------------------------

. merge m:1 fips using ../temp/demand.dta, keep(1 3)
(note: variable fips was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           195
        from master                       195  (_merge==1)
        from using                          0  (_merge==2)

    matched                             4,280  (_merge==3)
    -----------------------------------------

. drop if _merge == 1
(195 observations deleted)

. drop _merge

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
  sic_code_3 |          0
-------------+---------------------------------------------------------
  sic_code_4 |          0
        fips |      4,280    29746.63    15833.51       1001      56041
       labor |      4,276    22.34916    42.63522          1       1000
         rmc |      4,280           1           0          1          1
        name |          0
-------------+---------------------------------------------------------
       state |          0
         cea |      4,280    163.6255    92.48183          1        348
    dup_fips |      4,280           0           0          0          0
       naics |          0
         emp |      4,280    1108.819    2045.038          1      12277

. desc

Contains data from ../output/data.dta
  obs:         4,280                          
 vars:            15                          11 Jan 2021 16:00
 size:       496,480                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            double  %10.0g                FIPS Code
labor           double  %12.0g                
rmc             float   %9.0g                 
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
naics           str6    %9s                   
emp             long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 

. 
. 
end of do-file


