-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Main/code/../output/analy
> sis.log
  log type:  text
 opened on:  11 Jan 2021, 15:31:37

. 
. import delimited using ../temp/cea_fips_xw.csv, clear varnames(1)
(28 vars, 3,273 obs)

. ds
fips       census     v9         v13        v17        v21        v25
name       v6         land       v14        v18        v22        v26
state      v7         v11        v15        v19        v23        v27
statename  revised    v12        v16        v20        v24        v28

. keep fips name state v26 

. rename v26 cea

. unique cea
Number of unique values of cea is  355
Number of records is  3273

. gen ch_fip = regexm(fips, "[a-zA-Z]")

. drop if ch_fip == 1
(34 observations deleted)

. drop ch_fip

. destring fips, replace
fips: all characters numeric; replaced as long
(2 missing values generated)

. unique fips
Number of unique values of fips is  3238
Number of records is  3239

. duplicates tag fips, gen(dup_fips)

Duplicates in terms of fips

. tab dup_fips

   dup_fips |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,237       99.94       99.94
          1 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,239      100.00

. list if dup_fips > 0

      +--------------------------------------+
      | fips   name   state   cea   dup_fips |
      |--------------------------------------|
3238. |    .                    .          1 |
3239. |    .                    .          1 |
      +--------------------------------------+

. drop if dup_fips > 0
(2 observations deleted)

. desc

Contains data
  obs:         3,237                          
 vars:             5                          
 size:       129,480                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fips            long    %10.0g                FIPS
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save ../temp/xw.dta, replace
(note: file ../temp/xw.dta not found)
file ../temp/xw.dta saved

. 
. import delimited using ../temp/efsy_cbp_2016.csv, clear varnames(1)
(4 vars, 1,854,430 obs)

. desc

Contains data
  obs:     1,854,430                          
 vars:             4                          
 size:    24,107,590                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        byte    %8.0g                 
fipscty         int     %8.0g                 
naics           str6    %9s                   
emp             long    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if regexm(naics, "^23")
(1,727,513 observations deleted)

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    fipstate |    126,917    30.36973     15.1944          1         56
     fipscty |    126,917    98.85467    106.8014          1        840
       naics |          0
         emp |    126,917    246.4378    1529.883          1     160568

. 
. use ../temp/infogroup.dta, clear

. desc

Contains data from ../temp/infogroup.dta
  obs:        30,737                          
 vars:            54                          
 size:    33,195,960                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
archive_versi~r double  %12.0g                
abi             str12   %12s                  ABI Number
ticker          str6    %6s                   Ticker
parent_number   str12   %12s                  Parent Number
company         str32   %32s                  Name Of Business
address_line_1  str32   %32s                  Address
city            str18   %18s                  City
state           str4    %4s                   State
zipcode         str8    %8s                   Zip Code (5 Digit)
zip4            str6    %6s                   Zip Code Extension (4 Digit)
county_code     str6    %6s                   County Code
area_code       str6    %6s                   Area Code
idcode          str4    %4s                   Business/Individual Indicator
location_empl~e str4    %4s                   Location Employee Size Code
location_sale~e str4    %4s                   Location Sales Volume Code
primary_sic_c~e str8    %8s                   Primary SIC Code
sic6_descript~s str100  %100s                 SIC Code Description
primary_naics~e str10   %10s                  Primary NAICS Code
naics8_descri~s str100  %100s                 NAICS Description
sic_code        str8    %8s                   SIC Code
sic6_descript~c str100  %100s                 SIC Code Description
sic_code_1      str8    %8s                   SIC Code 1
sic6_descript~1 str100  %100s                 SIC Code 1 Description
sic_code_2      str8    %8s                   SIC Code 2
sic6_descript~2 str100  %100s                 SIC Code 2 Description
sic_code_3      str8    %8s                   SIC Code 3
sic6_descript~3 str100  %100s                 SIC Code 3 Description
sic_code_4      str8    %8s                   SIC Code 4
sic6_descript~4 str100  %100s                 SIC Code 4 Description
yellow_page_c~e str8    %8s                   Yellow Page Code
business_stat~e str4    %4s                   Business Status Code
industry_spec~e str4    %4s                   Industry Specific First Byte
office_size_c~e str2    %2s                   Office Size Code
company_holdi~s str4    %4s                   Company Holding Status
subsidiary_nu~r str12   %12s                  Subsidiary Number
parent_employ~e str4    %4s                   Parent Employee Size Code
parent_sales_~e str4    %4s                   Parent Sales Volume Code
site_number     str12   %12s                  Site Number
address_type_~r str4    %4s                   Address Type Indicator
population_code str4    %4s                   Population Code
census_tract    str8    %8s                   Census Tract
census_block    str4    %4s                   Census Block
match_code      str4    %4s                   Match Code
cbsa_code       str8    %8s                   CBSA Code
cbsa_level      str4    %4s                   CBSA Level
csa_code        str6    %6s                   CSA Code
fips_code       str8    %8s                   FIPS Code
year_establis~d double  %12.0g                
employee_size~n double  %12.0g                
sales_volume_~n double  %12.0g                
parent_actua~ze double  %12.0g                
parent_actua~me double  %12.0g                
latitude        double  %12.0g                Latitude
longitude       double  %12.0g                Longitude
-------------------------------------------------------------------------------
Sorted by: 

. keep primary_naics_code sic_code* fips_code employee_size_location archive 

. rename fips_code fips

. rename employ labor 

. rename archive year

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     30,737        2016           0       2016       2016
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
-------------+---------------------------------------------------------
  sic_code_3 |          0
  sic_code_4 |          0
        fips |          0
       labor |     30,729    11.26451    29.78996          1       2000

. desc

Contains data from ../temp/infogroup.dta
  obs:        30,737                          
 vars:             9                          
 size:     2,274,538                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
year            double  %12.0g                
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            str8    %8s                   FIPS Code
labor           double  %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. keep if year == 2016
(0 observations deleted)

. drop year

. destring fips, replace
fips: all characters numeric; replaced as long

. 
. gen rmc = regexm(primary_naics_code, "^3273")

. replace rmc = regexm(sic_code, "^3273") if rmc == 0
(53 real changes made)

. forv i = 1/4 {
  2.     replace rmc = regexm(sic_code_`i', "^3273") if rmc == 0
  3. }
(39 real changes made)
(14 real changes made)
(2 real changes made)
(6 real changes made)

. count if rmc
  4,475

. keep if rmc
(26,262 observations deleted)

. 
. drop if fips == 2230 | fips == 2275 | fips == 8014
(0 observations deleted)

. merge m:1 fips using ../temp/xw.dta, assert(2 3) keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             4,475  
    -----------------------------------------

. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
primary_na~e |          0
    sic_code |          0
  sic_code_1 |          0
  sic_code_2 |          0
  sic_code_3 |          0
-------------+---------------------------------------------------------
  sic_code_4 |          0
        fips |      4,475    29779.89    15812.87       1001      72139
       labor |      4,470    21.78121    41.84902          1       1000
         rmc |      4,475           1           0          1          1
        name |          0
-------------+---------------------------------------------------------
       state |          0
         cea |      4,475    163.9475      93.111          1        352
    dup_fips |      4,475           0           0          0          0

. desc

Contains data from ../temp/infogroup.dta
  obs:         4,475                          
 vars:            13                          
 size:       456,450                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
primary_naics~e str10   %10s                  Primary NAICS Code
sic_code        str8    %8s                   SIC Code
sic_code_1      str8    %8s                   SIC Code 1
sic_code_2      str8    %8s                   SIC Code 2
sic_code_3      str8    %8s                   SIC Code 3
sic_code_4      str8    %8s                   SIC Code 4
fips            long    %10.0g                FIPS Code
labor           double  %12.0g                
rmc             float   %9.0g                 
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. list if _n < 20

      +-----------------------------------------------------------------+
   1. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   521126 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1001  |    10  |   1  |   Autauga  |    AL  | 187  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   2. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |          |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1003  |     6  |   1  |   Baldwin  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   3. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   801101 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1005  |     6  |   1  |   Barbour  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   4. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   503208 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1013  |    10  |   1  |    Butler  |    AL  | 187  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   5. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   503106 |   762937 |   506368 |   508499 |   503999 |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1015  |    65  |   1  |   Calhoun  |    AL  |  12  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   6. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 23811001 |   521128 |   327301 |   503208 |   142901 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1015  |   120  |   1  |   Calhoun  |    AL  |  12  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   7. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1015  |     1  |   1  |   Calhoun  |    AL  |  12  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   8. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   999966 |   421304 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1019  |    20  |   1  |  Cherokee  |    AL  |  16  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
   9. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   152103 |   521128 |   421201 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1027  |     5  |   1  |      Clay  |    AL  |  63  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  10. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1031  |     6  |   1  |    Coffee  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  11. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   599972 |   726103 |   328198 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1031  |     6  |   1  |    Coffee  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  12. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32733102 |   503208 |   521128 |   503206 |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1033  |    10  |   1  |   Colbert  |    AL  |  94  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  13. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32733102 |   521128 |   503208 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1033  |     8  |   1  |   Colbert  |    AL  |  94  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  14. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   327209 |   171108 |   521128 |   171107 |   171108 |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1035  |    20  |   1  |   Conecuh  |    AL  | 183  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  15. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   521128 |          |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1039  |    10  |   1  | Covington  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  16. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   327209 |   171108 |   503208 |   521128 |   171107 |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1039  |    35  |   1  | Covington  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  17. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   344304 |   308902 |   503208 |   344998 |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1043  |    20  |   1  |   Cullman  |    AL  |  32  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  18. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32739002 |   177105 |   078111 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1045  |     1  |   1  |      Dale  |    AL  |  77  |         0  |
      +-----------------------------------------------------------------+

      +-----------------------------------------------------------------+
  19. | primar~e | sic_code | sic_co~1 | sic_co~2 | sic_co~3 | sic_co~4 |
      | 32732001 |   521128 |   177105 |          |          |          |
      |-----------------------------------------------------------------|
      | fips  | labor  | rmc  |      name  | state  | cea  |  dup_fips  |
      | 1047  |     5  |   1  |    Dallas  |    AL  | 187  |         0  |
      +-----------------------------------------------------------------+

. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. 
. tab labor

      labor |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        223        4.99        4.99
          2 |        286        6.40       11.39
          3 |        270        6.04       17.43
          4 |        298        6.67       24.09
          5 |        371        8.30       32.39
          6 |        266        5.95       38.34
          7 |        212        4.74       43.09
          8 |        203        4.54       47.63
          9 |         95        2.13       49.75
         10 |        266        5.95       55.70
         11 |         76        1.70       57.40
         12 |        138        3.09       60.49
         13 |         54        1.21       61.70
         14 |         69        1.54       63.24
         15 |        185        4.14       67.38
         16 |         29        0.65       68.03
         17 |         34        0.76       68.79
         18 |         35        0.78       69.57
         19 |         31        0.69       70.27
         20 |        215        4.81       75.08
         21 |         17        0.38       75.46
         22 |         35        0.78       76.24
         23 |         17        0.38       76.62
         24 |         11        0.25       76.87
         25 |        120        2.68       79.55
         26 |         16        0.36       79.91
         27 |         15        0.34       80.25
         28 |         10        0.22       80.47
         29 |         12        0.27       80.74
         30 |        139        3.11       83.85
         31 |          4        0.09       83.94
         32 |          7        0.16       84.09
         33 |          3        0.07       84.16
         34 |          7        0.16       84.32
         35 |         50        1.12       85.44
         36 |          4        0.09       85.53
         37 |          4        0.09       85.62
         38 |          9        0.20       85.82
         39 |          5        0.11       85.93
         40 |         70        1.57       87.49
         41 |          4        0.09       87.58
         42 |          5        0.11       87.70
         43 |          3        0.07       87.76
         44 |          3        0.07       87.83
         45 |         28        0.63       88.46
         46 |          2        0.04       88.50
         47 |          4        0.09       88.59
         48 |          7        0.16       88.75
         49 |          5        0.11       88.86
         50 |        115        2.57       91.43
         51 |          4        0.09       91.52
         52 |          2        0.04       91.57
         54 |          1        0.02       91.59
         55 |         11        0.25       91.83
         56 |          2        0.04       91.88
         58 |          3        0.07       91.95
         59 |          1        0.02       91.97
         60 |         35        0.78       92.75
         61 |          1        0.02       92.77
         63 |          2        0.04       92.82
         65 |         19        0.43       93.24
         66 |          2        0.04       93.29
         67 |          1        0.02       93.31
         70 |         24        0.54       93.85
         72 |          2        0.04       93.89
         75 |         22        0.49       94.38
         76 |          1        0.02       94.41
         78 |          1        0.02       94.43
         80 |         18        0.40       94.83
         81 |          1        0.02       94.85
         82 |          1        0.02       94.88
         85 |          3        0.07       94.94
         88 |          2        0.04       94.99
         89 |          1        0.02       95.01
         90 |         12        0.27       95.28
         93 |          1        0.02       95.30
         95 |          2        0.04       95.35
         97 |          1        0.02       95.37
         98 |          1        0.02       95.39
         99 |          5        0.11       95.50
        100 |         67        1.50       97.00
        101 |          4        0.09       97.09
        105 |          1        0.02       97.11
        110 |          7        0.16       97.27
        112 |          1        0.02       97.29
        120 |          8        0.18       97.47
        125 |         10        0.22       97.70
        126 |          1        0.02       97.72
        130 |          4        0.09       97.81
        140 |          6        0.13       97.94
        150 |         24        0.54       98.48
        154 |          1        0.02       98.50
        158 |          1        0.02       98.52
        160 |          5        0.11       98.64
        165 |          1        0.02       98.66
        170 |          2        0.04       98.70
        175 |          3        0.07       98.77
        180 |          1        0.02       98.79
        190 |          2        0.04       98.84
        200 |         19        0.43       99.26
        202 |          1        0.02       99.28
        210 |          1        0.02       99.31
        215 |          1        0.02       99.33
        220 |          1        0.02       99.35
        250 |         10        0.22       99.57
        300 |          9        0.20       99.78
        301 |          1        0.02       99.80
        350 |          1        0.02       99.82
        400 |          2        0.04       99.87
        450 |          1        0.02       99.89
        500 |          1        0.02       99.91
        600 |          2        0.04       99.96
        650 |          1        0.02       99.98
       1000 |          1        0.02      100.00
------------+-----------------------------------
      Total |      4,470      100.00

. 
. 
end of do-file


