-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Main/code/../output/analy
> sis.log
  log type:  text
 opened on:  11 Jan 2021, 21:33:47

. 
. import delimited using ../temp/cea_fips_xw.csv, clear varnames(1)
(28 vars, 3,273 obs)

. ds
fips       census     v9         v13        v17        v21        v25
name       v6         land       v14        v18        v22        v26
state      v7         v11        v15        v19        v23        v27
statename  revised    v12        v16        v20        v24        v28

. keep fips name state v26 

. rename v26 cea

. unique cea
Number of unique values of cea is  355
Number of records is  3273

. gen ch_fip = regexm(fips, "[a-zA-Z]")

. drop if ch_fip == 1
(34 observations deleted)

. drop ch_fip

. destring fips, replace
fips: all characters numeric; replaced as long
(2 missing values generated)

. unique fips
Number of unique values of fips is  3238
Number of records is  3239

. duplicates tag fips, gen(dup_fips)

Duplicates in terms of fips

. tab dup_fips

   dup_fips |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,237       99.94       99.94
          1 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,239      100.00

. list if dup_fips > 0

      +--------------------------------------+
      | fips   name   state   cea   dup_fips |
      |--------------------------------------|
3238. |    .                    .          1 |
3239. |    .                    .          1 |
      +--------------------------------------+

. drop if dup_fips > 0
(2 observations deleted)

. save ../temp/xw.dta, replace
(note: file ../temp/xw.dta not found)
file ../temp/xw.dta saved

. 
. import delimited using ../temp/efsy_cbp_2016.csv, clear varnames(1)
(4 vars, 1,854,430 obs)

. keep if regexm(naics, "^23")
(1,727,513 observations deleted)

. keep if naics == "236220"
(124,507 observations deleted)

. gen fips = fipstate*1000 + fipscty

. drop fipscty

. unique fips
Number of unique values of fips is  2410
Number of records is  2410

. rename emp x_cty

. 
. merge 1:1 fips using ../temp/xw.dta, keep(3) nogen
(note: variable fips was float, now double to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,407  
    -----------------------------------------

. bysort cea fipstate: egen x_state_cea = sum(x_cty)

. bysort cea: egen x_max_state = max(x_state_cea)

. gen is_max_state = x_state_cea == x_max_state

. gen cea_state = fipstate if is_max_state
(340 missing values generated)

. bysort cea: egen t_state = mean(cea_state) 

. assert t_state == cea_state if is_max_state

. bysort cea: egen x = sum(x_cty)

. drop cea_state x_max_state x_state_cea is_max_state

. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    fipstate |      2,407    30.02327    15.02053          1         56
       naics |          0
       x_cty |      2,407    232.4242    780.4467          1      12277
        fips |      2,407    30123.21    15037.34       1001      56043
        name |          0
-------------+---------------------------------------------------------
       state |          0
         cea |      2,407    169.0042    99.22879          1        348
    dup_fips |      2,407           0           0          0          0
     t_state |      2,407    29.79186    14.71792          1         56
           x |      2,407    3043.118    3966.238         48      20513

. desc

Contains data
  obs:         2,407                          
 vars:            10                          
 size:       151,641                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        byte    %8.0g                 
naics           str6    %9s                   
x_cty           long    %12.0g                
fips            double  %9.0g                 
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
t_state         float   %9.0g                 
x               float   %9.0g                 
-------------------------------------------------------------------------------
Sorted by: cea  fipstate
     Note: Dataset has changed since last saved.

. save ../temp/demand.dta, replace
(note: file ../temp/demand.dta not found)
file ../temp/demand.dta saved

. 
. use ../temp/infogroup.dta, clear

. keep primary_naics_code sic_code* fips_code employee_size_location archive 

. rename fips_code fips

. rename employ labor 

. rename archive year

. keep if year == 2016
(0 observations deleted)

. drop year

. destring fips, replace
fips: all characters numeric; replaced as long

. 
. gen rmc = regexm(primary_naics_code, "^32732")

. replace rmc = regexm(sic_code, "^3273") if rmc == 0
(78 real changes made)

. forv i = 1/4 {
  2.     replace rmc = regexm(sic_code_`i', "^3273") if rmc == 0
  3. }
(73 real changes made)
(26 real changes made)
(5 real changes made)
(6 real changes made)

. count if rmc
  1,638

. keep if rmc
(29,099 observations deleted)

. 
. merge m:1 fips using ../temp/demand.dta, keep(1 3)
(note: variable fips was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           124
        from master                       124  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,514  (_merge==3)
    -----------------------------------------

. drop if _merge == 1
(124 observations deleted)

. drop _merge

. 
. gen j = 1

. bysort cea: egen N_m = sum(j)

. drop j

. sum N_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         N_m |      1,514    11.10964    9.743837          1         45

. tab N_m

        N_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         69        4.56        4.56
          2 |         90        5.94       10.50
          3 |        165       10.90       21.40
          4 |        132        8.72       30.12
          5 |         70        4.62       34.74
          6 |        114        7.53       42.27
          7 |         56        3.70       45.97
          8 |         96        6.34       52.31
          9 |         18        1.19       53.50
         10 |         70        4.62       58.12
         11 |         66        4.36       62.48
         12 |         84        5.55       68.03
         13 |         52        3.43       71.47
         14 |         14        0.92       72.39
         15 |         45        2.97       75.36
         16 |         32        2.11       77.48
         17 |         51        3.37       80.85
         18 |         72        4.76       85.60
         19 |         38        2.51       88.11
         20 |         20        1.32       89.43
         24 |         24        1.59       91.02
         26 |         26        1.72       92.73
         29 |         29        1.92       94.65
         36 |         36        2.38       97.03
         45 |         45        2.97      100.00
------------+-----------------------------------
      Total |      1,514      100.00

. plot N_m x 

      45 +  
         |                       *
         |  
         |  
         |  
         |             *
         |  
         |  
         |                                         *
    N    |  
    _    |                                    *
    m    |                *
         |          *
         |         * *  **    *                     *
         |  ***   **   * *      *
         |     *  **  *                                *
         |  * ** ***   * * *
         | ***  ** *  ***          *   *            *         *
         | ******* **  *   *  *
         | *********     ** *         *          *   *                     *
       1 + ************  **       **    *
          +----------------------------------------------------------------+
               48                        x                           20513


. save ../output/data.dta, replace
(note: file ../output/data.dta not found)
file ../output/data.dta saved

. 
. 
end of do-file


