-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/loomis/home.grace/jkj32/entry/Data/Main/code/../output/analy
> sis.log
  log type:  text
 opened on:  22 Jan 2021, 16:31:15

. 
. import delimited using ../temp/cea_fips_xw.csv, clear varnames(1)
(28 vars, 3,273 obs)

. ds
fips       census     v9         v13        v17        v21        v25
name       v6         land       v14        v18        v22        v26
state      v7         v11        v15        v19        v23        v27
statename  revised    v12        v16        v20        v24        v28

. keep fips name state v26 

. rename v26 cea

. unique cea
Number of unique values of cea is  355
Number of records is  3273

. gen ch_fip = regexm(fips, "[a-zA-Z]")

. drop if ch_fip == 1
(34 observations deleted)

. drop ch_fip

. destring fips, replace
fips: all characters numeric; replaced as long
(2 missing values generated)

. unique fips
Number of unique values of fips is  3238
Number of records is  3239

. duplicates tag fips, gen(dup_fips)

Duplicates in terms of fips

. tab dup_fips

   dup_fips |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,237       99.94       99.94
          1 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,239      100.00

. list if dup_fips > 0

      +--------------------------------------+
      | fips   name   state   cea   dup_fips |
      |--------------------------------------|
3238. |    .                    .          1 |
3239. |    .                    .          1 |
      +--------------------------------------+

. drop if dup_fips > 0
(2 observations deleted)

. save ../temp/xw.dta, replace
(note: file ../temp/xw.dta not found)
file ../temp/xw.dta saved

. 
. import delimited using ../temp/efsy_cbp_2016.csv, clear varnames(1)
(4 vars, 1,854,430 obs)

. keep if regexm(naics, "^23")
(1,727,513 observations deleted)

. keep if naics == "236220"
(124,507 observations deleted)

. gen fips = fipstate*1000 + fipscty

. drop fipscty

. unique fips
Number of unique values of fips is  2410
Number of records is  2410

. rename emp x_cty

. 
. // Market Cluster Definition: Assign each CEA to state with greatest demand
. 
. merge 1:1 fips using ../temp/xw.dta, keep(3) nogen
(note: variable fips was float, now double to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,407  
    -----------------------------------------

. bysort cea fipstate: egen x_state_cea = sum(x_cty)

. bysort cea: egen x_max_state = max(x_state_cea)

. gen is_max_state = x_state_cea == x_max_state

. gen cea_state = fipstate if is_max_state
(340 missing values generated)

. bysort cea: egen t_state = mean(cea_state) 

. assert t_state == cea_state if is_max_state

. bysort cea: egen x = sum(x_cty)

. drop cea_state x_max_state x_state_cea is_max_state

. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    fipstate |      2,407    30.02327    15.02053          1         56
       naics |          0
       x_cty |      2,407    232.4242    780.4467          1      12277
        fips |      2,407    30123.21    15037.34       1001      56043
        name |          0
-------------+---------------------------------------------------------
       state |          0
         cea |      2,407    169.0042    99.22879          1        348
    dup_fips |      2,407           0           0          0          0
     t_state |      2,407    29.79186    14.71792          1         56
           x |      2,407    3043.118    3966.238         48      20513

. desc

Contains data
  obs:         2,407                          
 vars:            10                          
 size:       151,641                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
fipstate        byte    %8.0g                 
naics           str6    %9s                   
x_cty           long    %12.0g                
fips            double  %9.0g                 
name            str31   %31s                  Name
state           str2    %9s                   STATE
cea             int     %8.0g                 
dup_fips        byte    %12.0g                
t_state         float   %9.0g                 
x               float   %9.0g                 
-------------------------------------------------------------------------------
Sorted by: cea  fipstate
     Note: Dataset has changed since last saved.

. save ../temp/demand.dta, replace
(note: file ../temp/demand.dta not found)
file ../temp/demand.dta saved

. 
. use ../temp/infogroup.dta, clear

. keep abi parent_number primary_naics_code sic_code* fips_code ///
>     employee_size_location archive 

. rename fips_code fips

. rename employ labor 

. rename archive year

. keep if year == 2016
(0 observations deleted)

. drop year

. destring fips, replace
fips: all characters numeric; replaced as long

. 
. gen rmc = regexm(primary_naics_code, "^32732")

. replace rmc = regexm(sic_code, "^3273") if rmc == 0
(78 real changes made)

. forv i = 1/4 {
  2.     replace rmc = regexm(sic_code_`i', "^3273") if rmc == 0
  3. }
(73 real changes made)
(26 real changes made)
(5 real changes made)
(6 real changes made)

. count if rmc
  1,638

. keep if rmc
(29,099 observations deleted)

. 
. merge m:1 fips using ../temp/demand.dta
(note: variable fips was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,560
        from master                       124  (_merge==1)
        from using                      1,436  (_merge==2)

    matched                             1,514  (_merge==3)
    -----------------------------------------

. drop if _merge == 1
(124 observations deleted)

. drop _merge

. 
. merge m:1 fips using ../temp/costs.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           734
        from master                         1  (_merge==1)
        from using                        733  (_merge==2)

    matched                             2,949  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(734 observations deleted)

. drop _merge

. 
. // Firm Definition: Two firms with same parent company in a CEA are the same
. // Note that j is a unique firm ID within a CEA but not necessary across CEAs
. gen j = parent_number
(2,347 missing values generated)

. replace j = abi if missing(j) 
(912 real changes made)

. count
  2,949

. replace j = "NONE" if missing(j) 
(1,435 real changes made)

. replace labor = 0 if j == "NONE" 
(1,435 real changes made)

. collapse (sum) labor (mean) wage_jt = wage rent_jt = rent x t_state, by(j cea
> )

. bysort cea: egen wage = mean(wage_jt)

. bysort cea: egen rent = mean(rent_jt)

. drop wage_jt rent_jt

. count
  1,491

. unique j 
Number of unique values of j is  989
Number of records is  1491

. gen k = (j != "NONE")

. bysort cea: egen N_m = sum(k)

. drop k

. tab N_m

        N_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         46        3.09        3.09
          1 |        142        9.52       12.61
          2 |        151       10.13       22.74
          3 |        197       13.21       35.95
          4 |        162       10.87       46.81
          5 |        101        6.77       53.59
          6 |         90        6.04       59.62
          7 |         79        5.30       64.92
          8 |         99        6.64       71.56
          9 |         70        4.69       76.26
         10 |         33        2.21       78.47
         11 |         48        3.22       81.69
         12 |         26        1.74       83.43
         13 |         13        0.87       84.31
         14 |         15        1.01       85.31
         15 |         16        1.07       86.38
         16 |         17        1.14       87.53
         17 |         35        2.35       89.87
         18 |         38        2.55       92.42
         19 |         20        1.34       93.76
         22 |         23        1.54       95.31
         33 |         34        2.28       97.59
         35 |         36        2.41      100.00
------------+-----------------------------------
      Total |      1,491      100.00

. plot N_m x 

      35 +  
         |                       *
         |  
         |             *
         |  
         |  
         |  
         |  
         |  
    N    |                                         *
    _    |                                          *
    m    |           *  **    *
         |                      *             *
         |         *  *
         |    *    *
         |  *     **   * * *           *
         | *** *****   * *         *                   *      *
         |  ***  * **   *  *  *                     *
         | ******* ** ** ** *         *          *   *                     *
         | ************  ** *           *
       0 + ******                 **
          +----------------------------------------------------------------+
               48                    (mean) x                       20513


. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         cea |      1,491     164.497    94.83038          1        348
           j |          0
       labor |      1,491     25.8397    57.73654          0       1000
           x |      1,491    2924.116    3616.177         48      20513
     t_state |      1,491    30.57612    15.12081          1         56
-------------+---------------------------------------------------------
        wage |      1,491    887.7174    153.4152   560.2916   1898.417
        rent |      1,491    601.3295    160.2893      421.5       1559
         N_m |      1,491    7.586184    7.719568          0         35

. save ../output/data_firms.dta, replace
(note: file ../output/data_firms.dta not found)
file ../output/data_firms.dta saved

. 
. collapse (mean) N_m (sum) labor, by(cea t_state)

. save ../output/data_cea.dta, replace
(note: file ../output/data_cea.dta not found)
file ../output/data_cea.dta saved

. 
. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         cea |        348       174.5    100.6032          1        348
     t_state |        348    29.02011    16.14174          1         56
         N_m |        348     3.45977     4.19566          0         35
       labor |        348    110.7098    163.0872          0       1207

. gen M_t = 1 

. collapse (sum) N_t = N_m M_t, by(t_state)

. save ../output/data_state.dta, replace
(note: file ../output/data_state.dta not found)
file ../output/data_state.dta saved

. 
. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     t_state |         50       29.32    15.78224          1         56
         N_t |         50       24.08    20.73727          1         85
         M_t |         50        6.96    5.671123          1         28

. 
. 
end of do-file


